test/fplain.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://hcv.health.ontario.ca/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<SOAP-ENV:Header>
		<wsse:Security mustUnderstand="true">
			<wsse:UsernameToken>
				<wsse:Username>test_user</wsse:Username>
				<wsse:Password>test_pass</wsse:Password>
			</wsse:UsernameToken>
			<wsu:Timestamp>
				<wsu:Created>2017-07-18T01:32:47.577170+00:00</wsu:Created>
				<wsu:Expires>2017-07-18T01:34:17.577170+00:00</wsu:Expires>
			</wsu:Timestamp>
		</wsse:Security>
	</SOAP-ENV:Header>
	<ns0:Body>
		<ns1:validate>
			<requests>
				<hcvRequest>
					<healthNumber>9999999999</healthNumber>
					<versionCode>YX</versionCode>
				</hcvRequest>
			</requests>
			<locale>en</locale>
		</ns1:validate>
	</ns0:Body>
</SOAP-ENV:Envelope>